{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000, 4], "input_dtype": "float32", "sparse": false, "name": "sequence"}, "inbound_nodes": [], "name": "sequence"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1", "activity_regularizer": null, "trainable": true, "filter_length": 21, "init": "glorot_uniform", "bias": true, "nb_filter": 30, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["sequence", 0, 0]]], "name": "conv1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu1"}, "inbound_nodes": [[["conv1", 0, 0]]], "name": "relu1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv2", "activity_regularizer": null, "trainable": true, "filter_length": 21, "init": "glorot_uniform", "bias": true, "nb_filter": 30, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["relu1", 0, 0]]], "name": "conv2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu2"}, "inbound_nodes": [[["conv2", 0, 0]]], "name": "relu2"}, {"class_name": "MaxPooling1D", "config": {"stride": 40, "pool_length": 40, "trainable": true, "name": "maxpool", "border_mode": "valid"}, "inbound_nodes": [[["relu2", 0, 0]]], "name": "maxpool"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten"}, "inbound_nodes": [[["maxpool", 0, 0]]], "name": "flatten"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 750, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}, "inbound_nodes": [[["flatten", 0, 0]]], "name": "dense"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "output"}, "inbound_nodes": [[["dense", 0, 0]]], "name": "output"}], "input_layers": [["sequence", 0, 0]], "output_layers": [["output", 0, 0]], "name": "model_1"}}