{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000, 4], "input_dtype": "float32", "sparse": false, "name": "sequence"}, "inbound_nodes": [], "name": "sequence"}, {"class_name": "Compute1DReverseComplement", "config": {"trainable": true, "name": "revcomp_seq", "input_dim": null, "input_length": null}, "inbound_nodes": [[["sequence", 0, 0]]], "name": "revcomp_seq"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1", "activity_regularizer": null, "trainable": true, "filter_length": 21, "init": "glorot_uniform", "bias": true, "nb_filter": 15, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["sequence", 0, 0]], [["revcomp_seq", 0, 0]]], "name": "conv1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fwd_relu1"}, "inbound_nodes": [[["conv1", 0, 0]]], "name": "fwd_relu1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "rev_relu1"}, "inbound_nodes": [[["conv1", 1, 0]]], "name": "rev_relu1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv2", "activity_regularizer": null, "trainable": true, "filter_length": 21, "init": "glorot_uniform", "bias": true, "nb_filter": 15, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["fwd_relu1", 0, 0]], [["rev_relu1", 0, 0]]], "name": "conv2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fwd_relu2"}, "inbound_nodes": [[["conv2", 0, 0]]], "name": "fwd_relu2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "rev_relu2"}, "inbound_nodes": [[["conv2", 1, 0]]], "name": "rev_relu2"}, {"class_name": "MaxPooling1D", "config": {"stride": 40, "pool_length": 40, "trainable": true, "name": "fwd_maxpool", "border_mode": "valid"}, "inbound_nodes": [[["fwd_relu2", 0, 0]]], "name": "fwd_maxpool"}, {"class_name": "MaxPooling1D", "config": {"stride": 40, "pool_length": 40, "trainable": true, "name": "rev_maxpool", "border_mode": "valid"}, "inbound_nodes": [[["rev_relu2", 0, 0]]], "name": "rev_maxpool"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "fwd_flatten"}, "inbound_nodes": [[["fwd_maxpool", 0, 0]]], "name": "fwd_flatten"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "rev_flatten"}, "inbound_nodes": [[["rev_maxpool", 0, 0]]], "name": "rev_flatten"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 360, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}, "inbound_nodes": [[["fwd_flatten", 0, 0]], [["rev_flatten", 0, 0]]], "name": "dense"}, {"class_name": "Merge", "config": {"name": "mean_logits", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "ave", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["dense", 0, 0], ["dense", 1, 0]]], "name": "mean_logits"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "output"}, "inbound_nodes": [[["mean_logits", 0, 0]]], "name": "output"}], "input_layers": [["sequence", 0, 0]], "output_layers": [["output", 0, 0]], "name": "model_1"}}